src/Documents/ReceiveAndImportProducts/ReceiveAndImportProducts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ReceiveAndImportProducts</name>
  <registerRecords>AccumulationRegister.CashFlow</registerRecords>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Staff</name>
    <type>
      <types>CatalogRef.Staffs</types>
    </type>
  </attributes>
  <attributes>
    <name>Total</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Product</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Note</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/PaymentMethods/PaymentMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PaymentMethods</name>
  <enumValues>
    <name>Cash</name>
  </enumValues>
  <enumValues>
    <name>BankTransfer</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ReceiveAndImportProducts/Forms/DocumentDetail/Module.bsl
&AtClient
Procedure ProductsProductOnChange(Item)
	// Insert handler content.                 
//	DòngHiệnTại= Items.Products.CurrentData;  
//	DòngHiệnTại.ĐơnVịTính = FillUnit(DòngHiệnTại.Product);
	TabularSectionRow = Items.Products.CurrentData;  
	TabularSectionRow.Unit = FillUnit(TabularSectionRow.Product);
EndProcedure

&AtServer
Function FillUnit ( CurProduct )
	Return CurProduct.Unit;
EndFunction

&AtClient
Procedure ProductsQuantityOnChange(Item)
	// Insert handler content. 
	//DòngHiệnTại= Items.Products.CurrentData;
	//CalculateAmount(DòngHiệnTại);   
	TabularSectionRow = Items.Products.CurrentData;
	CalculateAmount(TabularSectionRow);
EndProcedure           


&AtClient
Procedure ProductsPriceOnChange(Item)
	// Insert handler content.     
	//DòngHiệnTại= Items.Products.CurrentData;
	//CalculateAmount(DòngHiệnTại);  
	TabularSectionRow = Items.Products.CurrentData;
	CalculateAmount(TabularSectionRow);
	
EndProcedure    

&AtClient
Procedure CalculateAmount(CurRow)
	CurRow.Amount = CurRow.Quantity * CurRow.Price;
	Object.Total = Object.Products.Total("Amount");
EndProcedure


&AtServer
Procedure PaymentMethodOnChangeAtServer()
	If Object.PaymentMethod = Enums.PaymentMethods.Cash Then
		 ThisObject.CommandBar.ChildItems.FormCreateBasedOn.Visible = False;
	 Else
		ThisObject.CommandBar.ChildItems.FormCreateBasedOn.Visible = True; 
	EndIf
EndProcedure


&AtClient
Procedure PaymentMethodOnChange(Item)
	PaymentMethodOnChangeAtServer();
EndProcedure
